:PROPERTIES:
:ID: 43cd4a31-e209-4fa8-b2b9-486345d711c8
:END:
#+title: Notifications
#+description: Notifications
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:events:
#+created: 2026-05-21
#+updated: 2026-05-21

Display and clear pending notifications.

#+name: events-notifications
#+begin_src ores-shell :exports none
events notifications
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<events-notifications>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> No pending notifications.
ores-shell> Bye!
#+end_example
